tap "adur1990/tap"
tap "oven-sh/bun"
# Run your GitHub Actions locally
brew "act"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Bash and zsh history suggest box
brew "hstr"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI search and replace | Space Age seD
brew "sad"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Open source IDE for exploring and testing APIs
cask "bruno"
cask "font-geist-mono-nerd-font"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "adpyke.codesnap"
vscode "anseki.vscode-color"
vscode "apollographql.vscode-apollo"
vscode "austenc.tailwind-docs"
vscode "bbenoist.nix"
vscode "beatzoid.http-status-codes"
vscode "bierner.markdown-preview-github-styles"
vscode "bmalehorn.shell-syntax"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "edsonjaramillo.edsonjaramillo.earthshine"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "jackmacwindows.vscode-computercraft"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "monish.regexsnippets"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samverschueren.linter-xo"
vscode "shakram02.bash-beautify"
vscode "statiolake.vscode-rustfmt"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "tyriar.sort-lines"
vscode "unional.vscode-sort-package-json"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "wallabyjs.quokka-vscode"
vscode "xaver.clang-format"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zeshuaro.vscode-python-poetry"
